#+TITLE:  Emacs配置文件
#+AUTHOR: 付亚军
#+EMAIL:  fuyajun1983cn@163.com

* emacs使用版本
  使用如下命令查看emacs版本
  #+BEGIN_SRC sh
  emacs --version
  #+END_SRC

  #+RESULTS:
  | GNU       | Emacs | 24.5.1       |        |            |             |           |        |          |       |          |
  | Copyright | (C)   | 2015         | Free   | Software   | Foundation, | Inc.      |        |          |       |          |
  | GNU       | Emacs | comes        | with   | ABSOLUTELY | NO          | WARRANTY. |        |          |       |          |
  | You       | may   | redistribute | copies | of         | Emacs       |           |        |          |       |          |
  | under     | the   | terms        | of     | the        | GNU         | General   | Public | License. |       |          |
  | For       | more  | information  | about  | these      | matters,    | see       | the    | file     | named | COPYING. |

  #+BEGIN_SRC emacs-lisp 
    (require 'server)
    (unless (server-running-p)
      (server-start))
  #+END_SRC

